cookbook.org
:PROPERTIES:
#+STARTUP: overview inlineimages
#+TAGS: @baking @breakfast @entree @side @soup @stew @sauce @dressing
#+TAGS: GF(g)
#+OPTIONS: toc:nil
#+HUGO_BASE_DIR: /home/trevdev/Projects/os-cookbook/
#+HUGO_SECTION: recipe
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_FRONT_MATTER_FORMAT: yaml
:END:
#+TITLE: Open Source Cookbook
#+AUTHOR: "Trev"
** Steak Sauce
:PROPERTIES:
:export_file_name: steak-sauce
:export_hugo_custom_front_matter: :servings 12
:export_hugo_custom_front_matter+: :prep-time 5
:export_hugo_custom_front_matter+: :cook-time 0
:export_hugo_custom_front_matter+: :ready-in 5
:export_hugo_custom_front_matter+: :source-url https://www.allrecipes.com/recipe/86516/steak-sauce/
:END:
*** Ingredients

- Try with Tamarind
- 1  1/4 cups ketchup
- 2 tablespoons prepared yellow mustard
- 3 tablespoons Worcestershire sauce
- 1  1/2 tablespoons apple cider vinegar
- 4 drops hot pepper sauce (e.g. Tabasco)
- 1/2 teaspoon salt
- 1/2 teaspoon ground black pepper

*** Directions
1. In a medium bowl, mix together the ketchup, mustard, Worcestershire sauce, vinegar, hot pepper sauce, salt and pepper. Transfer to a jar and refrigerate until needed.

