content/recipe/steak-sauce.md
---
title: "Steak Sauce"
author: ["Trev"]
lastmod: 2022-05-30T11:03:41-07:00
categories: ["sauce"]
draft: false
servings: 12
prep-time: 5
cook-time: 0
ready-in: 5
source-url: "https://www.allrecipes.com/recipe/86516/steak-sauce/"
---

## Ingredients {#ingredients}

-   Try with Tamarind
-   1  1/4 cups ketchup
-   2 tablespoons prepared yellow mustard
-   3 tablespoons Worcestershire sauce
-   1  1/2 tablespoons apple cider vinegar
-   4 drops hot pepper sauce (e.g. Tabasco)
-   1/2 teaspoon salt
-   1/2 teaspoon ground black pepper


## Directions {#directions}

1.  In a medium bowl, mix together the ketchup, mustard, Worcestershire sauce, vinegar, hot pepper sauce, salt and pepper. Transfer to a jar and refrigerate until needed.